<?php

function translit(string $text) : string {

  $alfabet = [
    'а' => 'a',   'б' => 'b',   'в' => 'v',
    'г' => 'g',   'д' => 'd',   'е' => 'e',
    'ё' => 'e',   'ж' => 'zh',  'з' => 'z',
    'и' => 'i',   'й' => 'y',   'к' => 'k',
    'л' => 'l',   'м' => 'm',   'н' => 'n',
    'о' => 'o',   'п' => 'p',   'р' => 'r',
    'с' => 's',   'т' => 't',   'у' => 'u',
    'ф' => 'f',   'х' => 'h',   'ц' => 'c',
    'ч' => 'ch',  'ш' => 'sh',  'щ' => 'sch',
    'ь' => '\'',  'ы' => 'y',   'ъ' => '\'',
    'э' => 'e',   'ю' => 'yu',  'я' => 'ya',
    'А' => 'A',   'Б' => 'B',   'В' => 'V',
    'Г' => 'G',   'Д' => 'D',   'Е' => 'E',
    'Ё' => 'E',   'Ж' => 'Zh',  'З' => 'Z',
    'И' => 'I',   'Й' => 'Y',   'К' => 'K',
    'Л' => 'L',   'М' => 'M',   'Н' => 'N',
    'О' => 'O',   'П' => 'P',   'Р' => 'R',
    'С' => 'S',   'Т' => 'T',   'У' => 'U',
    'Ф' => 'F',   'Х' => 'H',   'Ц' => 'C',
    'Ч' => 'Ch',  'Ш' => 'Sh',  'Щ' => 'Sch',
    'Ь' => '\'',  'Ы' => 'Y',   'Ъ' => '\'',
    'Э' => 'E',   'Ю' => 'Yu',  'Я' => 'Ya'
  ];

  // Специальные символы
  $specialChars = ['.', ',', '!', '?', ':', ';', ' ', '"'];

  $result = '';
  // Итерация по символам
  foreach (preg_split('//u', $text, -1, PREG_SPLIT_NO_EMPTY) as $char) {
    // Проверка наличия в массиве транслитерации
    if(isset($alfabet[$char])) {
      // Учет регистра
      if (strtoupper($char) === $char) {
        $result .= $alfabet[$char];
      } else {
        $result .= $alfabet[$char];
      }
    } elseif (in_array($char, $specialChars)) {
      // Добавление специальных символов без изменений
      $result .= $char;
    } else {
      // Пропуск неизвестных символов
      continue;
    }
  }
  return $result;
}

// Примеры использования функции
echo translit('"Привет!"'); // Выведет "Privet!"


//docker run --rm -v ${pwd}/php-cli/:/cli php:8.2-cli php /cli/code/task_4.php